# 算术运算符： +  -  *  /  //  %  **
print("10 + 4 = ", 10 + 4)   # 加
print("10 - 4 = ", 10 - 4)   # 减
print("10 * 4 = ", 10 * 4)   # 乘
print("10 / 4 = ", 10 / 4)   # 除 - 2.5
print("10 // 4 = ", 10 // 4) # 整除(结果为整数) - 2
print("10 % 4 = ", 10 % 4)   # 取余/求模 - 2
print("10 ** 4 = ", 10 ** 4) # 幂指数，10的4次方 - 10000

# 算术运算符的优先级 --> ** 最高 --> * / // % --> + -
print("0.1 + 10 / 4**2 = ", 0.1 + 10 / 4 ** 2)


# 案例：输入两个数 x 和 y，计算 x + y 以及 x - y 的结果并输出
# float(...) ---> 将其他类型 转为 浮点数类型
x = float(input("请输入x的值："))
y = float(input("请输入y的值："))

# 0.0999999999999998 --> 精度损失；由于计算机底层是基于二进制进行数据的存储与处理，二进制是无法准确的表示所有的小数，因此涉及到浮点数的运算，可能会出现精度误差
print("x + y = ", x + y)
print("x - y = ", x - y)
