# if条件判断: 如果分数超过680，我就去清华读书
score = 600
if score > 680:
    print("欢迎你来清华读书")
    print("也恭喜你即将踏入精彩的大学生活")

print("---------------------------")


# if案例：结合前面学习的输入输出及if条件判断的知识，完成B站登录功能的实现（正确账号和密码为 188888888888/6668888）
# 正确的账号和密码
ok_account = "188888888888"
ok_password = "6668888"

# 1. 接收用户输入的账号和密码
account = input("请输入您的B站账号：")
password = input("请输入您的B站密码：")

# 2. 判断账号和密码是否全部正确，如果都正确，则登录成功，进入B站首页
if account == ok_account and password == ok_password:
    print("登录成功 ~")
    print("进入B站首页 ~")
else:
    print("登录失败！")
    print("账号或密码错误！")


# 案例1：根据用户输入的年份，判断这一年是闰年还是平年(非整百年份，且能被4整除的年份是闰年；整百年份(如 1900、2000) 必须被400整除才是闰年)
year = int(input("请输入需要判定的年份："))

# 如果是 非整百年份，且能被4整除 就是闰年 ; 整百年份，必须被400整除 也是闰年
if (year % 100 != 0 and year % 4 == 0) or (year % 400 == 0):
    print(f"{year} 是闰年")
else:
    print(f"{year} 是平年")
